app/views/favorites/_favorite-btn.html.erb

		<i class="fa fa-heart" aria-hidden="true"></i>
		<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]

		<i class="fa fa-heart-o" aria-hidden="true"></i>
		<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]