app/views/books/_index.html.erb

        <td>
					<%= link_to "コメント数#{book.book_comments.count}", book_path(book) %>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]