app/views/books/show.html.erb

					<td>
						<p class="comments-count">コメント数：<%= @book.book_comments.count %></p>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]