app/controllers/search_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE 'unkoman')
SELECT "books".* FROM "books" WHERE (title LIKE 'データベース入門')
---
  def search
		@user_or_book = params[:option]
		@how_search = params[:choice]
	  if @user_or_book == "user"
	    @users = User.search(params[:search], @user_or_book, @how_search)
	  else
	    @books = Book.search(params[:search], @user_or_book, @how_search)